# 变量
# 变量类似方程式中的未知数或函数中的自变量，
# 用来指代数字、自变量等
# 变量的创建分为命名和赋值
# 变量名仅可以包含大小写字母、数字和下划线_
# 请注意，变量名不能以数字开头

# 创建变量，变量名：x，值：100
x = 100
print('x=', x)
# 变量的值是可以更改的
x = 1000
print('更改后， x=', x)
x = 'Hello'
print('更改后， x=', x)

# 如果变量为数字，可进行运算
x = 10
print('x+10=', x + 10)
print('x-5=', x - 5)
print('x*2=', x * 2)
print('x/2=', x / 2)
print('x**2-(x+8)*x=', x**2 - (x + 8) * x)

# 变量为字符串时
str = 'Hi'
print('str=', str)
print('str+str=', str, str)
print('str*10=', str * 10)

# 使用变量的好处
# 1. 可以重复使用
# 2. 更改一处，处处更改
